Ran Plan for 6 projects:

1. dir: `bruno-athaide-product-test/poc-config-v3` workspace: `default`
1. dir: `bruno-athaide-product-test/poc-config-v3/forno` workspace: `default`
1. dir: `bruno-athaide-product-test/poc-config-v3/prod` workspace: `default`
1. dir: `bruno-athaide-product-test/poc-config-v3/shared` workspace: `default`
1. dir: `bruno-athaide-product-test/segments` workspace: `default`
1. dir: `bruno-athaide-product-test/shared` workspace: `default`
---

### 1. dir: `bruno-athaide-product-test/poc-config-v3` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.configcat_products.my_products: Reading...
data.configcat_products.my_products: Read complete after 1s [id=1756148387]
data.configcat_environments.prod_environment: Reading...
data.configcat_environments.prod_environment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756148387]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_config.my_config will be created
+ resource "configcat_config" "my_config" {
      + description        = "POC Config V3 description - testing"
      + evaluation_version = "v2"
      + id                 = (known after apply)
      + name               = "POC Config V3"
      + order              = 0
      + product_id         = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ config_id  = (known after apply)
+ product_id = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/poc-config-v3
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fpoc-config-v3%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/poc-config-v3
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `bruno-athaide-product-test/poc-config-v3/forno` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.configcat_products.my_products: Reading...
data.configcat_products.my_products: Read complete after 1s [id=1756148392]
data.configcat_configs.my_configs: Reading...
data.configcat_environments.forno_environment: Reading...
data.configcat_configs.my_configs: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756148392]
data.configcat_environments.forno_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756148392]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_setting.my_forno_ff will be created
+ resource "configcat_setting" "my_forno_ff" {
      + config_id    = "08dde3fb-a28a-4266-8bcc-e9f2e63a1cdd"
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "MyFornoFF"
      + name         = "My Forno Feature Flag"
      + order        = 1
      + setting_type = "boolean"
    }

  # configcat_setting_value_v2.my_forno_ff_value will be created
+ resource "configcat_setting_value_v2" "my_forno_ff_value" {
      + environment_id = "08ddc62c-1047-4871-8ffa-78230983a9d9"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + bool_value = false
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/poc-config-v3/forno
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fpoc-config-v3%252Fforno%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/poc-config-v3/forno
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 3. dir: `bruno-athaide-product-test/poc-config-v3/prod` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.configcat_products.my_products: Reading...
data.configcat_products.my_products: Read complete after 1s [id=1756148396]
data.configcat_configs.my_configs: Reading...
data.configcat_segments.beta_users_segment: Reading...
data.configcat_environments.prod_environment: Reading...
data.configcat_environments.prod_environment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756148397]
data.configcat_configs.my_configs: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756148397]
data.configcat_segments.beta_users_segment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756148397]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_setting.my_second_ff will be created
+ resource "configcat_setting" "my_second_ff" {
      + config_id    = "08dde3fb-a28a-4266-8bcc-e9f2e63a1cdd"
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "MySecondFF"
      + name         = "My Second Feature Flag"
      + order        = 1
      + setting_type = "boolean"
    }

  # configcat_setting.my_string_setting_v2 will be created
+ resource "configcat_setting" "my_string_setting_v2" {
      + config_id    = "08dde3fb-a28a-4266-8bcc-e9f2e63a1cdd"
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "StringSettingKey"
      + name         = "String setting"
      + order        = 0
      + setting_type = "string"
    }

  # configcat_setting_value_v2.my_second_ff_value will be created
+ resource "configcat_setting_value_v2" "my_second_ff_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + bool_value = false
        }
    }

  # configcat_setting_value_v2.string_setting_value will be created
+ resource "configcat_setting_value_v2" "string_setting_value" {
      + environment_id  = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id              = (known after apply)
      + init_only       = true
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + targeting_rules = [
          + {
              + conditions = [
                  + {
                      + user_condition = {
                          + comparator           = "sensitiveTextEquals"
                          + comparison_attribute = "email"
                          + comparison_value     = {
                              + string_value = "@configcat.com"
                            }
                        }
                    },
                ]
              + value      = {
                  + string_value = "custom"
                }
            },
          + {
              + conditions = [
                  + {
                      + segment_condition = {
                          + comparator = "isIn"
                          + segment_id = "08dde199-45b9-4bba-81ca-35544c64b56b"
                        }
                    },
                ]
              + value      = {
                  + string_value = "beta-feature"
                }
            },
        ]
      + value           = {
          + string_value = "test"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/poc-config-v3/prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fpoc-config-v3%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/poc-config-v3/prod
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 4. dir: `bruno-athaide-product-test/poc-config-v3/shared` workspace: `default`
```diff
Changes to Outputs:
+ config_name = "POC Config V3"

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/poc-config-v3/shared
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fpoc-config-v3%252Fshared%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/poc-config-v3/shared
  ```

---
### 5. dir: `bruno-athaide-product-test/segments` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.configcat_products.my_products: Reading...
data.configcat_products.my_products: Read complete after 1s [id=1756148404]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_segment.beta_users will be created
+ resource "configcat_segment" "beta_users" {
      + comparator           = "sensitiveIsOneOf"
      + comparison_attribute = "email"
      + comparison_value     = "betauser1@example.com,betauser2@example.com"
      + description          = "Beta users' description"
      + id                   = (known after apply)
      + name                 = "Beta users"
      + product_id           = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ beta_users_segment_id = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/segments
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fsegments%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/segments
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 6. dir: `bruno-athaide-product-test/shared` workspace: `default`
```diff
Changes to Outputs:
+ product_name = "Bruno Athaide Product Test"

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/shared
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fshared%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/shared
  ```

---
### Plan Summary

6 projects, 6 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```